{
    "paper_title": "Responsible AI and the Arts: The Ethical and Legal Implications of AI in the Arts and Creative Industries",
    "publication_info": "Proceedings of the First … - dl.acm.org",
    "authors": "AM Piskopani, A Chamberlain…",
    "publication_year": "2023",
    "url": "https://ora.ox.ac.uk/objects/uuid:a803ecc0-c8cc-42a0-be17-848334dc3cf5/files/r5d86p1015",
    "headings": [
        {
            "title": "ABSTRACT",
            "text": "This position piece starts to examine the ways in which AI-basedautonomous technologies have begun to influence a range of humanactivities in the arts and creative industries.The rise of AI-generatedart could potentially transform the act of creation and impact ourunderstandings of creativity – from painting, writing, and musiccomposition, to video animation. At the same time, there is increas-ing debate about the social, ethical, and legal implications of usingthese tools (eg copyright, biased data sets, devaluing artistic pro-cesses). Responsible Innovation (RI) could have a crucial role toplay in understanding and responding to the complexity of debates.We will explore and unpack how artists, AI developers and asso-ciated audiences/consumers of art have started to approach someof these issues. We will use these ideas as a starting point to ex-plicate and further develop discourses surrounding the challengesassociated with these technologies in the context of the creativeindustries. Finally, we will investigate how and if these challengesmight be addressed.CCS CONCEPTS• Social and professional topics; • Applied computing → Law;KEYWORDSdatasets, neural networks, creative industries"
        },
        {
            "title": "1 INTRODUCTION",
            "text": "In recent years, advances in AI research have produced a plethoraof algorithms applying Generative AI techniques. Companies haveused these algorithms to create generative AI art-based platforms.The most popular of these are Stable Diffusion, DALL-E 2, Midjour-ney and Stability AI. Users enter text prompts into a text-basedinterface, and the model then produces content (video, image, text)based on its training dataset. At the end of 2022 ChatGPT arguablybecame a genre of tool in its own right, it is able to replicate ordinarylanguage and can create a sense of conversation.Since these generative tools can also produce high quality art-work from text prompts using artistic styles, keywords, subjectsand concepts, creators have started using them. In February 2022,the winning photo in an Australian photography competition wascreated by AI generative tools.[12] A few months later, The Crow,an “AI-made” film won the Jury Award at the Cannes Short FilmFestival[23]. In September 2022, an artist used text-to-image soft-ware to take the top prize in the Colorado Art Fair .[28] AI-generatedart has been used for the covers of magazines, such as the Economistand Cosmopolitan, while stock image libraries, including Adobeand Dreamstime, have also started to accept AI-generated images.Contemporary artists are still discussing if using AI-generatedwork represents a massive cultural shift – this is linked to debatescentring on how these developments will impact upon human cre-ativity. Will such tools democratise the creative processes, as someAI supporters suggest, and will tools be developed that encapsulatehumanity’s artistic flair ?Debates are also ongoing among artists, AI developers, policy-makers, and art audiences about the legality of the outputs fromgenerative AI systems and their responsible development and use.How will these tools affect creative industries? Will they cost artistsand illustrators their jobs? Are they fair? Were they designed withsufficient respect for people’s rights? Do they infringe copyright?Are they capable of other forms of harm? Are they trustworthyenough to be used by anyone who wishes to? Is the existing regu-latory framework sufficient to confront these challenges? What istheir future impact on art and upcoming artists? Is there somethingsocially important at stake?"
        },
        {
            "title": "2 AI AND ART: THE POTENTIAL BENEFITS",
            "text": "Although the founders of AI platforms, such as Midjourney, claimthat these tools will augment people’s imagination, the artisticcommunity seems divided about using AI as a creative tool.[16]Some visual artists can clearly see the potential benefits. For exam-ple, Refic Anadol, has been exploring the use of computer-basedtechniques developed as an artistic tool for years. In 2022 Anadolreceived a commission by American museum MoMa to create anartwork based on 138,000 artworks from the museum’s collection.His work Unsupervised casts shapeshifting images of museum art-works curated in real time. Some critics characterised it as a costlyand shallow screensaver.[35] Other artists are just beginning toexperiment with these tools. Many artists enjoy the rapidity of theresults. Danielle Baskin, who creates \"alternate realities\", used towork with Photoshop but now uses a system such as DALL-E 2as a quicker way to realise her artistic vision.[18] The routine andrepetitive tasks of creators such as video editing could potentiallybe performed more quickly and efficiently by algorithms, whilstartists who explore dystopian or sci-fi visions in their work findinspiration in AI aesthetics.[16]Professor Ted Underwood believes these tools could be a power-ful educational tool for artists as they give them the opportunity toexplore the entire corpus of art in an active and creative way[34].Some have characterised it as ’collective unconsciousness’ or be-lieve that it could be a fertile ground for a new aesthetic movement,similar to early 20th century surrealism.[20]. Others believe that itis a form of conceptual art.[10] Creative process has always beenbased on previous art for technical knowledge and inspiration. Us-ing these systems can also become a new artistic process and changethe focus from the mental and technical skills acquired throughendless practice to creative ideation, skilful use of language, andcuratorial taste. ‘Prompting’ could become an new artistic skill.For example, Jason Allen, who won the Colorado Art Fair with hiswork “Théâtre D’opéra Spatial” by experimenting with differenttext prompts, had no artistic background. Instead, he devoted timeand energy to testing different scenarios, settings, and effects untilhe reached a result that he thought was a form of supernaturalreality. His win was considered controversial, and to be a threatto human art and creativity. Despite this pushback, contest judgeMcKinley said that she would not change her judgement becauseshe valued the concept and the vision of the artist as well as theartwork itself. She concluded that the AI was a tool with which toadvance what an artist envisions.[17]"
        },
        {
            "title": "3 CHALLENGES FROM AI GENERATIVE ART",
            "text": "While some artists explore the artistic potential of using these toolsas inspiration or enablers of their work, others considered thattheir rights have been violated, feel powerless to confront the techcompanies and express concerns and fears about the impact of theiruse in art and human creativity."
        },
        {
            "title": "3.1 Copyright infringement",
            "text": "Many artists and illustrators say that AI generators are often trainednot only by public domain images but also by copyrighted imagesscraped from their portfolios on sites like Pinterest and Artstationwithout their knowledge or license. For example Greg Rutkowski,an established Poland-based digital creator, uses classical paintingstyles to create dreamy fantasy landscapes. Rutkowski’s name hasbeen used as a prompt around 93,000 times and when he discoveredthis, he realised the risks these systems posed.[3]On January 2023 three artists (Sarah Andersen, Kelley McKernan,and Karla Ortiz) filed a class action against three companies offering AI image generators (Stability AI, Midjourney, DeviantArt). In theircomplaint, the artists argue that the companies obtained access totheir copyrighted works through web scraping. The outputs arederivative works of the images it draws from as they permit usersto create works “in the style of...” . They also claim that the AI-created works could compete against their own existing work inthe marketplace. In the following weeks, Getty Images initiatedcopyright infringement legal proceedings against Stability AI bothin a US and an UK court, with similar claims ."
        },
        {
            "title": "3.2 Privacy concerns",
            "text": "In 2022 a California-based AI artist with the pseudonym, Lapine,searched “Have I Been Trained”, a website created by artists to helpother artists to find out if their work has been used to train algo-rithms. Instead of her artwork, Lapine uploaded a medical photo andfound out that her photo, which depicted her rare medical condition,was included in the image set. The photo had been circulating onthe internet without her knowledge and consent. LAION-5B doesnot host the images but simply points to other websites from whichusers can upload them. Lapine will need to discover the hostingwebsite and ask to be removed. She is distressed by the fact thather photos have been used to train algorithms and possibly createAI-generated images without her consent, and her experience haschanged how she will engage with these tools in the future. Shefeels reluctant to use AI art and hesitates to use generated photore-alistic images of people for fear of unknowingly violating others’rights. [2]"
        },
        {
            "title": "3.3 Biased datasets",
            "text": "Fears are also expressed that as AI generators are trained by datasetsthat are not diverse enough, any work based on them could beamplifying or perpetuating racist and sexist prejudice and racialstereotypes. According to Tracey Spicer, a journalist and socialjustice advocate, if someone asks AI-generated art platforms forimages of a CEO, it’s generally an older white male. If the usersearch “nurses”, the images are almost all females and if the userdoes not specify skin colour, the default image will be white people.[32] Also, these AI models shown bias against certain groups, likeMuslims, whom it disproportionately associates with violence andterrorism[29]."
        },
        {
            "title": "3.4 Devaluing art",
            "text": "An AI-generated children’s book that was created in a weekendcaused strong reactions. [27] Children’s book author and illustra-tor, Rob Biddulph, said that AI-generated art “is the exact oppositeof what I believe art to be. Fundamentally, I have always felt thatart is all about translating something that you feel internally intosomething that exists externally. And simply pressing a button togenerate an image is not a creative process.” Artists are concernedthat these tools undermine artistic work and reinforce opinionsthat artists’ work is easy, and they do not need to be well-paid.[30]In January 2023 a Nick Cave fan asked ChatGPT to create a songin the style of his favourite artist – he then sent it to Nick Cave.Cave responded, calling it a “grotesque mockery of what it is to bea human”. He explained his artistic process as following: “ it is thebreathless confrontation with one’s vulnerability, one’s perilousness,one’s smallness, pitted against a sense of sudden shocking discovery; itis the redemptive artistic act that stirs the heart of the listener, wherethe listener recognizes in the inner workings of the song their ownblood, their own struggle, their own suffering.” [7] AI could convertart – an inner process of self-revelation, of asking deep questionsabout life, of creating a desire for truth and authenticity, of deephuman communication – into a fast, fun, and shallow substitute."
        },
        {
            "title": "3.5 Forging",
            "text": "Another ethical issue is whether the artist has the obligation toreveal if he used generative AI and under what circumstance. TheColorado Fair Contest’s winner explained that he decided to keepit a secret in an attempt to prove the artistic potential of AI. Hisdecision was perceived as an attempt to cheat. People argued thathe should return the award and post a public apology .[17] Thissuggests an unsettling feeling when one discovers that a work hasbeen created by algorithm – as though something inauthentic hasentered the relationship between the artist and the audience. It is afeeling of betrayal, cheating, or fraud. The experience instils thefear of being deceived in the future. The audience cannot easilydistinguish AI art from human art and this confusion is expectedto become even deeper.[37]"
        },
        {
            "title": "3.6 Social impact and fears for the future",
            "text": "AI platforms’ supporters claim that these platforms can ’democra-tise’ the creative process, as such tools put the power of creativ-ity into the hands of more people, enabling them to participatein high-value content creation.[14] Artists question whether this’democratisation’ will benefit society as whole or just a few privatecompanies who can monetise the \"essence\" of living artists’ workand appropriate humanity’s collective imagination and knowledge.[9]As artists are not compensated, they fear that these technologiesmay have a detrimental impact on their income. Furthermore, up-and-coming artists could lose assignments for small projects, whichthey often rely on to build up their portfolio[30]. There is also arisk of artistic skills and forms of art atrophying."
        },
        {
            "title": "4 CONFRONTING THE CHALLENGES4.1 Copyright law reforms",
            "text": "Generative AI tools rely on having access to and analysing largenumbers of artworks in order to produce results. Although thistext- and data-mining infringes copyright, there is wide disparityin the scope of exceptions in national copyright laws as regards fairuse.[13] , [6] These exceptions are not clear and have not adequatelytaken into consideration the recent AI generative art paradigm.In June 2022 UK government announced a plan to introduce anew copyright and database exception which allows data miningfor any purpose to foster AI innovation – with no opt-out forrights holders. After discussion with representatives of creativeindustries, the government decided to rethink this. There is also legal uncertainty about the copyright status of AI-created works.[8], [4]There are debates about who will be considered as the authorof these works (prompter? investor? developer?) and under whichconditions/ requirements.[5] [36], [25] [15]New legal provisionsthat would balance these conflicting interests and rights could resultin more trustworthy and socially acceptable innovations."
        },
        {
            "title": "4.2 AI Principles",
            "text": "Many experts agree that algorithms and AI should be “ethical bydesign” with no in-built bias, created in a way that guaranteesthe respect of citizens’ fundamental rights, and the avoidance ofpotential liability. [22]The main principles are: explainability, fair-ness, accountability, transparency. Of key importance is also theresponsibility principle, to ensure the availability of measures toredress adverse individual or social effects of an algorithmic systemand designate a person responsible for the timely remedy of theseissues. [11]Some generative AI platforms attempt to address these principles.They may publish terms of use, have AI ethics research teams, orcooperate to formulate best practice. A few companies, such asStability AI, accept that it is unfair to use the work of millionsof artists without any credit or compensation and are willing tocorrect the injustice[24] Some platforms inform users about whichdatasets they use and point out that other platforms, such as OPENAI, do not.[2] It seems more difficult to comply with the principlesof fairness and explainability. These datasets have in-built bias [29]and it is still difficult to explain how they work.[31] Some techcompanies attempt to confront the legal and ethical challenges butthese efforts vary and additional measures are needed[19]."
        },
        {
            "title": "4.3 AI regulation and rights",
            "text": "In recent years, agencies have sought to regulate AI – in the UK,policymakers are not currently considering regulation beyond theOnline Safety Bill, but have not excluded the possibility. The EU,USA and China have all proposed new AI regulation. Artists’ associ-ations are suggesting a specific section in the EU AI Act dedicated tothe creative arts, including safeguards requiring that rights-holdersgive explicit, informed consent before their work is used by AItools.[21]Some governments and international organizations propose AIrights, principles and measures for the design and development ofAI applications. Oversight and public consultation are consideredimportant measures to protect human rights."
        },
        {
            "title": "4.4 Responsible innovation (RI)",
            "text": "RI’s purpose is to create processes that enable the exploration ofinnovation and its potential consequences in an open, inclusive, andtimely way. Developers of new technologies should be trained toengage with stakeholders to anticipate pathways, reflect on impact,and respond accordingly. [33]The researchers who developed Dramatron, an interactive co-writing tool, have followed such processes. They assessed possiblerisks, invited artists to write screenplays and theatre scripts usingthis tool and finally asked them to reflect on the process and theirresponse to it.[26]RI can provide an opportunity for people that are often excludedfrom these discussions to be heard and to influence legislation andpolicies. AI-generated art can challenge people’s values and theirperception of the world, but using RI principles to engage artists,critics and audience in the debate could contribute to identify socialimplications and potential risks of generative AI-based art. Theycould contribute to development of technologies responsible bydesign[1] This would provide an opportunity to the artistic commu-nity to be prepared for future development which may affect themdirectly. For example art schools could teach students about thesenew tools, and legal and ethical ways to use them . Art contestscould have a category purely devoted to AI art. Additionally, thepublic could learn how to identify content that is created by AI andwhat is best practice for using these tools."
        },
        {
            "title": "5 FUTURE WORK",
            "text": "The multiple legal and ethical implications discussed here threatenthe trustworthiness and acceptability of these new technologies.Deployed in responsible ways, however, generative AI tools couldnot only enhance the work of artists, but be used to enable thecreation of entirely new forms of art and expression. Artists acceptthe potential of this growing genre of tool and do not ask for themto be banned, but they want to control their level of involvement,and for their rights to be protected. Mostly they want to safeguardwhat they see as important aspects of human creativity, and bereassured that these will not be undermined or made redundantby potential AI technological storms. Initiating such discussions,discourses and debate is part of our future research goal, as part ofour Responsible AI approach."
        },
        {
            "title": "REFERENCES",
            "text": ""
        }
    ]
}